---
kind: property
id: P:Autodesk.Revit.UI.UIDocument.Application
source: html/afecfdc0-04cd-47d5-ddd5-e94b41d8555b.htm
---
# Autodesk.Revit.UI.UIDocument.Application Property

Retrieves an object that represents the current Application.

## Syntax (C#)
```csharp
public UIApplication Application { get; }
```